# Рабочий график
# 1.Рабочий день начинается в 09:30 и заканчивается в 18:00.
# 2.Опоздание — приход позднее 09:40.
# 3.Ранний уход — уход ранее 17:50.
# 4.Если регистрации на входе или выходе нет, сотрудник считается опоздавшим или ушедшим раньше времени.

# Как работает считыватель
# При входе и выходе из здания сотрудники регистрируются на считывателе карт.
# Карты есть у всех.
# Регистрация происходит при каждом проходе мимо считывателя, в том числе если человек вышел подышать свежим воздухом.
# Считыватель не определяет направление движения: вход это или выход.
# Сотрудник может не зарегистрироваться на входе или выходе.

# Допущения
# Это мои решения там, где условие молчит. Каждое можно заменить, если заказчик ответит иначе.

# Определение прихода и ухода
# Направление прохода неизвестно, поэтому первая регистрация за день считается приходом, а последняя считается уходом.
# Если регистрация за день одна, она считается приходом. Для проверки раннего ухода такой день нужно считать отдельно.
# Промежуточные регистрации (вышел подышать воздухом и вернулся) на опоздание не влияют.

# Одна из проблем
# Если сотрудник пришел вовремя, но остался на рабочем на месте до след. утра 10:00 то за вчерашний день он - ушедшим раньше времени, а за сегодняшний он уже опоздал

# Первое задание.
# Нужно ли включать регистрации людей, которых нет в Users? Слова «все регистрации» предполагают включение, но это стоит явно зафиксировать.
# Требуется ли определённый порядок вывода: по времени события, по имени пользователя или иной? В условии порядок не задан.
# За какую дату нужны регистрации: текущую или произвольную, заданную пользователем?
# Включать ли людей, которых нет в Users?

#Первый запрос возвращает все сохранённые события регистрации за выбранные календарные сутки: имя из записи и зафиксированное время события.
# На основании этих данных можно судить о наличии отметок, но нельзя достоверно определить направление прохода,
# фактическое время прихода и ухода или отсутствие сотрудника в офисе.
#
#
#одним запросом T-SQL выбрать все регистрации (имя пользователя, время события) за день (за сутки);
# В запросе нужно получить все регистрации за сутки.
# За сутки берем время с 0:00 до 23:59:59, 0:00 считаем началом дня.

# В таблице(регистраций карт-пропусков) отсутствует fk user_id, могут быть пользователи, которых нету в таблице с пользователями(Таблица сотрудников фирмы) - данные не согласованны.
# Проблемы 1. Маловероятно, но если у нас два человека с одинаковым ФИО, то как мы поймем кому принадлежит регистрация?
# Проблема 2. А если в таблице users пользователя зарегали так - Петров Олег Александрович, а в таблице с регистрациями он Петров О.А.
# т.е. при поиске по полному ФИО в таблице(регистраций карт-пропусков) записи могут не найтись, хотя события того же человека сохранены под сокращённым именем.
#
# В целом это не мешает получить все регистрации из таблицы за сутки.
  
SELECT
    s.username,
    s.eventdatetime
FROM stat AS s
WHERE s.eventdatetime >= $1
  AND s.eventdatetime <  $1 + INTERVAL '1 day'
ORDER BY - будет дорого если индекс останется по eventdatetime, можем индекс по eventdatetime и добавить составной индекс (eventdatetime, eventid) только нужно ли это?
    s.eventdatetime,
    s.eventid;

# второй запрос
# одним запросом T-SQL выбрать все опоздания (имя пользователя, время прихода)
# за день, включая незарегистрированных в таблице Stat (не пришёл в офис);
#
# Сотрудник может не зарегистрироваться на входе или выходе.

# 1. Сотрудник может войти в офис не зарегистривовшись? т.е. он пришел в офис обойдя регистрицию и потом вышел на перекур в 10:00 пройдя регистрацию, теперь он считается опоздавшим?
# Что считать временем прихода?
# Что считать временем прихода, если считыватель не различает вход и выход, а регистрации могут пропускаться?
# Допускается ли считать первую отметку за сутки приходом, даже если фактически она могла соответствовать выходу?
#
# 2. Что считаем опоздание? - Опозданием считается приход позднее 09:40, ранним уходом – уход ранее 17:50.
# а что делать если у сотрудника за день стоит одна регистрацию 16:00 это поздний приход или ранний уход?
# по логике если это одна регистрация сотрудника за день то это опоздание
# Если сотрудник пришёл в 09:30, а в 10:00 ушёл на перекур и больше не вернулся? а если вернулся в обход регистрации? У нас нет данных чтоб отследить такое?
#
# 3. Часть формулировки задания не совсем понятна - включая незарегистрированных в таблице Stat (не пришёл в офис)
#  из за этого "Сотрудник может не зарегистрироваться на входе или выходе", но скорее всего имеется в виду что нужны все сотрудники из двух таблиц
# В таком случае нам нужно будет объединить данные(ФИО из двух таблиц), но что делаем с дублями? убираем или оставляем?
# Как отличить дубли от "одноОФИовцев(одинаковое ФИО у двух чел:))" вероятность низкая. Может исказить данные - как понять какой сотрудник отсутствует, а какой в офисе и т.п.
#
# Выходит сотрудники которые не пришли в офис считаются опоздавшими.
#
# Сложно полагаться на достоверность данных в текущей таблицы, если мы даже не можем гарантировано сказать, что все сотрудники проходят регистрацию.
# Выходит сотрудник может просто прийти в офис и уйти из офиса не пройдя регистрацию? если верить условию задачи - Сотрудник может не зарегистрироваться на входе или выходе.
  
WITH first_events AS (
    SELECT
        s.username,
        MIN(s.eventdatetime) AS arrival_time
    FROM stat AS s
    WHERE s.eventdatetime >= $1::date
      AND s.eventdatetime <  $1::date + INTERVAL '1 day'
    GROUP BY s.username
),
employees AS (
    SELECT u.username
    FROM users AS u

    UNION

     SELECT f.username
     FROM first_events AS f
)
SELECT
    e.username,
    f.arrival_time
FROM employees AS e
LEFT JOIN first_events AS f
    ON f.username = e.username
WHERE f.arrival_time IS NULL
   OR f.arrival_time > $1::date + TIME '09:40:00'
ORDER BY
    e.username;


# Третий запрос.
# Как понять в каких дни работают сотрудники? Какой у них график?5/2? Субботу и воскресение учитываем или нет?
# Может взять дефолтный график 5/2 и считать только будни.
#
# Нужно вывести всех сотрудников, значит будут те у кого нет опозданий. Им пишем null или 0?
